app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
  def index
    @messages = Message.order('created_at DESC')

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "asdg"], ["created_at", Mon, 26 Aug 2013 03:44:22 PDT -07:00], ["updated_at", Mon, 26 Aug 2013 03:44:22 PDT -07:00]]
---
  def create
    @message = Message.create!(params[:message])